---
kind: enumMember
id: F:Autodesk.Revit.DB.EntryAndSchemeConsistency.InvalidFillPatternId
enum: Autodesk.Revit.DB.EntryAndSchemeConsistency
source: html/be67c45f-7c5d-51f6-686d-d33993737f16.htm
---
# Autodesk.Revit.DB.EntryAndSchemeConsistency.InvalidFillPatternId

The fill pattern id is not valid.